/*
Наследование:

Наследование - это способность классов наследовать свойства других классов. Под свойствами понимается переменные и методы.
При наследовании различают базовый класс (родительский класс) и производный класс (дочерний).

Один и тот же класс одновременно может быть как базовым, так и дочерним, а цепочка наследования может быть бесконечно длинной.

Базовый класс не знает, сколько и каких классов от него унаследовано, а дочерний класс знает лишь своего ближайшего родителя.

Базовый класс обобщает (generalization) свойства разных классов и собирает их в себе. Дочерние классы расширяют свойства базового класса и дополняют их своими собственными свойствами.
Именно поэтому в некоторых языках программирования наследование реализуется ключевым словом extends.

Наследование реализует отношение между классами типа "является" (is-a), поэтому прежде чем что-то от чего то унаследовать, нужно убедиться, что "что-то" является "чем-то".

Наследование позволяет повторно использовать код базового класса в дочерних классах, благодаря чему, можно в значительной степени сократить объем исходного кода.


*/